#############
# Automatically generated by 'contentctl build' from 
# https://github.com/splunk/contentctl
# On Date: 2026-02-18T10:30:16 UTC
# Author: author name - author company
# Contact: author@contactemailaddress.com
#############
[default]
disabled = 1
description = "This search was removed in a previous release, or is otherwise not present."
search = | makeresults | eval text = "This search was removed in a previous release, or is otherwise not present."

### DAC Windows Security DETECTIONS ###


[DAC Windows Security - Anomalous usage of 7zip - Rule]
action.escu = 0
action.escu.enabled = 1
description = The following detection identifies a 7z.exe spawned from `Rundll32.exe` or `Dllhost.exe`. It is assumed that the adversary has brought in `7z.exe` and `7z.dll`. It has been observed where an adversary will rename `7z.exe`. Additional coverage may be required to identify the behavior of renamed instances of `7z.exe`. During triage, identify the source of injection into `Rundll32.exe` or `Dllhost.exe`. Capture any files written to disk and analyze as needed. Review parallel processes for additional behaviors. Typically, archiving files will result in exfiltration. 
action.escu.mappings = {"cis20": ["CIS 10"], "mitre_attack": ["T1560.001"], "nist": ["DE.AE"]}
action.escu.data_models = ["Endpoint"]
action.escu.eli5 = The following detection identifies a 7z.exe spawned from `Rundll32.exe` or `Dllhost.exe`. It is assumed that the adversary has brought in `7z.exe` and `7z.dll`. It has been observed where an adversary will rename `7z.exe`. Additional coverage may be required to identify the behavior of renamed instances of `7z.exe`. During triage, identify the source of injection into `Rundll32.exe` or `Dllhost.exe`. Capture any files written to disk and analyze as needed. Review parallel processes for additional behaviors. Typically, archiving files will result in exfiltration.
action.escu.how_to_implement = To successfully implement this search you need to be ingesting information on process that include the name of the process responsible for the changes from your endpoints into the `Endpoint` datamodel in the `Processes` node.
action.escu.known_false_positives = False positives should be limited as this behavior is not normal for `rundll32.exe` or `dllhost.exe` to spawn and run 7zip.
action.escu.creation_date = 2021-04-22
action.escu.modification_date = 2021-04-22
action.escu.confidence = high
action.escu.search_type = detection
action.escu.product = ["Splunk Enterprise", "Splunk Enterprise Security", "Splunk Cloud"]
action.escu.providing_technologies = ["Carbon Black Response", "CrowdStrike Falcon", "Microsoft Sysmon", "Microsoft Windows", "Symantec Endpoint Protection"]
action.escu.analytic_story = ["Cobalt Strike"]
action.risk = 1
action.risk.param._risk_message = An instance of $parent_process_name$ spawning $process_name$ was identified on endpoint $dest$ by user $user$. This behavior is indicative of suspicious loading of 7zip.
action.risk.param._risk = [{"risk_object_field": "dest", "risk_object_type": "system", "risk_score": 60}, {"risk_object_field": "user", "risk_object_type": "user", "risk_score": 56}, {"threat_object_field": "parent_process_name", "threat_object_type": "parent_process_name"}, {"threat_object_field": "process_name", "threat_object_type": "process_name"}]
action.risk.param._risk_score = 0
action.risk.param.verbose = 0
cron_schedule = 0 * * * *
dispatch.earliest_time = -70m@m
dispatch.latest_time = -10m@m
action.correlationsearch.enabled = 1
action.correlationsearch.detection_type = ebd
action.correlationsearch.label = DAC Windows Security - Anomalous usage of 7zip - Rule
action.correlationsearch.annotations = {"analytic_story": ["Cobalt Strike"], "cis20": ["CIS 10"], "data_source": ["Sysmon EventID 1"], "mitre_attack": ["T1560.001"], "nist": ["DE.AE"], "type": "Anomaly", "type_list": ["Anomaly"]}
action.correlationsearch.metadata = {"deprecated": "0", "detection_id": "9364ee8e-a39a-11eb-8f1d-acde48001122", "detection_version": "1", "publish_time": 1619049600.0}
schedule_window = auto
alert.digest_mode = 1
disabled = true
enableSched = 1
allow_skew = 100%
counttype = number of events
relation = greater than
quantity = 0
realtime_schedule = 0
is_visible = false
search = | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime from datamodel=Endpoint.Processes where Processes.parent_process_name IN ("rundll32.exe", "dllhost.exe") Processes.process_name=*7z* by Processes.dest Processes.user Processes.parent_process Processes.process_name Processes.process Processes.process_id Processes.parent_process_id Processes.parent_process_name | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`| `anomalous_usage_of_7zip_filter`
action.notable.param.drilldown_searches = [{"earliest_offset": "$info_min_time$", "latest_offset": "$info_max_time$", "name": "View the detection results for $user$ and $dest$", "search": "| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime from datamodel=Endpoint.Processes where Processes.parent_process_name IN (\"rundll32.exe\", \"dllhost.exe\") Processes.process_name=*7z* by Processes.dest Processes.user Processes.parent_process Processes.process_name Processes.process Processes.process_id Processes.parent_process_id Processes.parent_process_name | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`| `anomalous_usage_of_7zip_filter` | search  user = $user$ dest = $dest$"}, {"earliest_offset": "$info_min_time$", "latest_offset": "$info_max_time$", "name": "View risk events for the last 7 days for $user$ and $dest$", "search": "| from datamodel Risk.All_Risk | search normalized_risk_object IN ($user$, $dest$) starthoursago=168 endhoursago=1 | stats count min(_time) as firstTime max(_time) as lastTime values(search_name) as \"Search Name\" values(risk_message) as \"Risk Message\" values(analyticstories) as \"Analytic Stories\" values(annotations._all) as \"Annotations\" values(annotations.mitre_attack.mitre_tactic) as \"ATT\u0026CK Tactics\" by normalized_risk_object | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`"}]

[DAC Windows Security - Windows Failed Logons Burst - Rule]
action.escu = 0
action.escu.enabled = 1
description = Detects a burst of failed Windows logons in a short period, indicating potential brute force attacks. 
action.escu.mappings = {"cis20": ["CIS 10"], "mitre_attack": ["T1110"], "nist": ["DE.CM"]}
action.escu.data_models = []
action.escu.eli5 = Detects a burst of failed Windows logons in a short period, indicating potential brute force attacks.
action.escu.how_to_implement = Requires Windows Security Event Log ingestion and CIM mapping where applicable.
action.escu.known_false_positives = Users forgetting passwords or misconfigured scripts.
action.escu.creation_date = 2026-02-18
action.escu.modification_date = 2026-02-18
action.escu.confidence = high
action.escu.search_type = detection
action.escu.product = ["Splunk Enterprise", "Splunk Enterprise Security", "Splunk Cloud"]
action.escu.providing_technologies = null
action.escu.analytic_story = ["Windows Endpoint Activity"]
action.risk = 1
action.risk.param._risk_message = Potential brute force detected
action.risk.param._risk = [{"risk_object_field": "user", "risk_object_type": "user", "risk_score": 10}, {"threat_object_field": "src_ip", "threat_object_type": "ip_address"}]
action.risk.param._risk_score = 0
action.risk.param.verbose = 0
cron_schedule = 0 * * * *
dispatch.earliest_time = -70m@m
dispatch.latest_time = -10m@m
action.correlationsearch.enabled = 1
action.correlationsearch.detection_type = ebd
action.correlationsearch.label = DAC Windows Security - Windows Failed Logons Burst - Rule
action.correlationsearch.annotations = {"analytic_story": ["Windows Endpoint Activity"], "cis20": ["CIS 10"], "data_source": ["Windows Security 4625"], "mitre_attack": ["T1110"], "nist": ["DE.CM"], "type": "TTP", "type_list": ["TTP"]}
action.correlationsearch.metadata = {"deprecated": "0", "detection_id": "be8f2615-e376-4ed9-8da9-b7cb73c7b9e0", "detection_version": "1", "publish_time": 1771372800.0}
schedule_window = auto
action.notable = 1
action.notable.param._entities = [{"risk_object_field": "N/A", "risk_object_type": "N/A", "risk_score": 0}]
action.notable.param.nes_fields = user,dest
action.notable.param.rule_description = Detects a burst of failed Windows logons in a short period, indicating potential brute force attacks.
action.notable.param.rule_title = Windows Failed Logons Burst
action.notable.param.security_domain = endpoint
action.notable.param.severity = informational
alert.digest_mode = 1
disabled = true
enableSched = 1
allow_skew = 100%
counttype = number of events
relation = greater than
quantity = 0
realtime_schedule = 0
is_visible = false
search = index=wineventlog sourcetype=WinEventLog:Security EventCode=4625 \
| bin _time span=5m \
| stats count by _time, user, src_ip \
| where count >= 20 \
| `windows_failed_logons_burst_filter`
action.notable.param.drilldown_searches = [{"earliest_offset": "$info_min_time$", "latest_offset": "$info_max_time$", "name": "View the detection results for a user and source IP", "search": "index=wineventlog sourcetype=WinEventLog:Security EventCode=4625\n| bin _time span=5m\n| stats count by _time, user, src_ip\n| where count \u003e= 20\n| `windows_failed_logons_burst_filter`\n | search user=\"$user$\" src_ip=\"$src_ip$\""}, {"earliest_offset": "$info_min_time$", "latest_offset": "$info_max_time$", "name": "View risk events for the last 7 days for a user and source IP", "search": "| from datamodel Risk.All_Risk\n| search normalized_risk_object IN (\"$user$\", \"$src_ip$\") starthoursago=168\n| stats count min(_time) as firstTime max(_time) as lastTime values(search_name) as \"Search Name\" values(risk_message) as \"Risk Message\"\n"}]

### END DAC Windows Security DETECTIONS ###

### DAC Windows Security BASELINES ###



### DAC Windows Security RESPONSE TASKS ###



### END DAC Windows Security RESPONSE TASKS ###